; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p7---int100n150-m25---int100c110---s69---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level10 level10)
(sum level0 level12 level12)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level10 level11)
(sum level1 level12 level13)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level10 level12)
(sum level2 level12 level14)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level10 level13)
(sum level3 level12 level15)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level10 level14)
(sum level4 level12 level16)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level10 level15)
(sum level5 level12 level17)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level10 level16)
(sum level6 level12 level18)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level10 level17)
(sum level7 level12 level19)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level10 level18)
(sum level8 level12 level20)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level10 level19)
(sum level9 level12 level21)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level10 level20)
(sum level10 level12 level22)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level10 level21)
(sum level11 level12 level23)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level10 level22)
(sum level12 level12 level24)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level10 level23)
(sum level13 level12 level25)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level10 level24)
(sum level14 level12 level26)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level10 level25)
(sum level15 level12 level27)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level10 level26)
(sum level16 level12 level28)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level10 level27)
(sum level17 level12 level29)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level10 level28)
(sum level18 level12 level30)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level10 level29)
(sum level19 level12 level31)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level10 level30)
(sum level20 level12 level32)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level10 level31)
(sum level21 level12 level33)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level10 level32)
(sum level22 level12 level34)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level10 level33)
(sum level23 level12 level35)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level10 level34)
(sum level24 level12 level36)
(sum level24 level21 level45)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level10 level35)
(sum level25 level12 level37)
(sum level25 level21 level46)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level10 level36)
(sum level26 level12 level38)
(sum level26 level21 level47)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level10 level37)
(sum level27 level12 level39)
(sum level27 level21 level48)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level10 level38)
(sum level28 level12 level40)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level10 level39)
(sum level29 level12 level41)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level10 level40)
(sum level30 level12 level42)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level10 level41)
(sum level31 level12 level43)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level10 level42)
(sum level32 level12 level44)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level10 level43)
(sum level33 level12 level45)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level10 level44)
(sum level34 level12 level46)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level10 level45)
(sum level35 level12 level47)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level10 level46)
(sum level36 level12 level48)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level10 level47)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level10 level48)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level42 level6 level48)

(connected l0 l1)
(fuelcost level10 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l0 l3)
(fuelcost level21 l0 l3)
(connected l1 l0)
(fuelcost level10 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l3)
(fuelcost level7 l1 l3)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l3)
(fuelcost level12 l2 l3)
(connected l3 l0)
(fuelcost level21 l3 l0)
(connected l3 l1)
(fuelcost level7 l3 l1)
(connected l3 l2)
(fuelcost level12 l3 l2)

(at t0 l3)
(fuel t0 level48)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l0)
(at p3 l2)
(at p4 l3)
(at p5 l2)
(at p6 l3)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l1)
(at p5 l1)
(at p6 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 7
2. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 7
3. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 7
4. (drive t0 l3 l2 level36 level12 level48)
   deleted: (at t0 l3) (fuel t0 level48)
   added: (at t0 l2) (fuel t0 level36)
   goals met: 0 of 7
5. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 7
6. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 7
7. (drive t0 l2 l1 level30 level6 level36)
   deleted: (at t0 l2) (fuel t0 level36)
   added: (at t0 l1) (fuel t0 level30)
   goals met: 0 of 7
8. (drive t0 l1 l0 level20 level10 level30)
   deleted: (at t0 l1) (fuel t0 level30)
   added: (at t0 l0) (fuel t0 level20)
   goals met: 0 of 7
9. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 7
10. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 7
11. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 1 of 7
12. (drive t0 l0 l1 level10 level10 level20)
   deleted: (at t0 l0) (fuel t0 level20)
   added: (at t0 l1) (fuel t0 level10)
   goals met: 1 of 7
13. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 7
14. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 7
15. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 7
16. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 5 of 7
17. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 6 of 7
18. (drive t0 l1 l2 level4 level6 level10)
   deleted: (at t0 l1) (fuel t0 level10)
   added: (at t0 l2) (fuel t0 level4)
   goals met: 6 of 7
19. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 7 of 7
